HloModule jit_step, entry_computation_layout={(u32[2]{0}, f64[1,1,5]{2,1,0}, f64[5]{0}, f64[5,5]{1,0}, f64[100]{0}, /*index=5*/f64[100]{0}, f64[100,5]{1,0}, s64[1]{0}, f64[5]{0}, f64[5]{0}, /*index=10*/f64[5]{0}, f64[5]{0}, f64[100]{0}, f64[5,100]{1,0}, f64[10]{0}, /*index=15*/f64[100,10]{1,0})->(f64[5]{0}, f64[5]{0}, f64[5]{0}, f64[5]{0}, f64[100]{0}, /*index=5*/f64[5,100]{1,0}, f64[10]{0}, f64[100,10]{1,0}, s32[], pred[], /*index=10*/s32[], s32[], f64[5]{0}, f64[5]{0}, f64[5]{0}, /*index=15*/f64[5]{0}, f64[100]{0}, f64[5,100]{1,0}, f64[10]{0}, f64[100,10]{1,0}, /*index=20*/f64[5]{0}, f64[5]{0}, f64[5]{0}, f64[5]{0}, f64[100]{0}, /*index=25*/f64[5,100]{1,0}, f64[10]{0}, f64[100,10]{1,0}, f64[5]{0}, f64[5,5]{1,0}, /*index=30*/f64[100,5]{1,0}, f64[100,5]{1,0}, f64[100,5]{1,0}, f64[100,5]{1,0}, f64[100,100]{1,0}, /*index=35*/f64[100,5,100]{2,1,0}, f64[100,10]{1,0}, f64[100,100,10]{2,1,0}, f64[100,5]{1,0}, f64[100,5]{1,0}, /*index=40*/f64[100,5]{1,0}, f64[100,5]{1,0}, f64[100,100]{1,0}, f64[100,5,100]{2,1,0}, f64[100,10]{1,0}, /*index=45*/f64[100,100,10]{2,1,0}, f64[100]{0}, f64[100]{0}, f64[100,5]{1,0}, f64[50]{0}, /*index=50*/f64[5]{0}, f64[5]{0})}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}

%fused_computation (param_0.2: u32[], param_1.5: u32[4], param_2.6: u32[50], param_3.7: u32[50], param_4.12: s64[]) -> u32[50] {
  %param_3.7 = u32[50]{0} parameter(3)
  %param_2.6 = u32[50]{0} parameter(2)
  %add.1647 = u32[50]{0} add(u32[50]{0} %param_3.7, u32[50]{0} %param_2.6), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %param_1.5 = u32[4]{0} parameter(1)
  %slice.453 = u32[1]{0} slice(u32[4]{0} %param_1.5), slice={[0:1]}, metadata={op_name="jit(step)/jit(main)/while/body/slice[start_indices=(0,) limit_indices=(1,) strides=(1,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %reshape.4231 = u32[] reshape(u32[1]{0} %slice.453), metadata={op_name="jit(step)/jit(main)/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6643 = u32[50]{0} broadcast(u32[] %reshape.4231), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-left.165 = u32[50]{0} shift-left(u32[50]{0} %param_2.6, u32[50]{0} %broadcast.6643), metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %constant.5073 = u32[] constant(32)
  %subtract.307 = u32[] subtract(u32[] %constant.5073, u32[] %reshape.4231), metadata={op_name="jit(step)/jit(main)/while/body/sub" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6642 = u32[50]{0} broadcast(u32[] %subtract.307), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-right-logical.166 = u32[50]{0} shift-right-logical(u32[50]{0} %param_2.6, u32[50]{0} %broadcast.6642), metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %or.196 = u32[50]{0} or(u32[50]{0} %shift-left.165, u32[50]{0} %shift-right-logical.166), metadata={op_name="jit(step)/jit(main)/while/body/or" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %xor.202 = u32[50]{0} xor(u32[50]{0} %add.1647, u32[50]{0} %or.196), metadata={op_name="jit(step)/jit(main)/while/body/xor" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %add.1646 = u32[50]{0} add(u32[50]{0} %add.1647, u32[50]{0} %xor.202), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %slice.452 = u32[1]{0} slice(u32[4]{0} %param_1.5), slice={[1:2]}, metadata={op_name="jit(step)/jit(main)/while/body/slice[start_indices=(1,) limit_indices=(2,) strides=(1,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %reshape.4230 = u32[] reshape(u32[1]{0} %slice.452), metadata={op_name="jit(step)/jit(main)/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6640 = u32[50]{0} broadcast(u32[] %reshape.4230), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-left.164 = u32[50]{0} shift-left(u32[50]{0} %xor.202, u32[50]{0} %broadcast.6640), metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %subtract.306 = u32[] subtract(u32[] %constant.5073, u32[] %reshape.4230), metadata={op_name="jit(step)/jit(main)/while/body/sub" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6638 = u32[50]{0} broadcast(u32[] %subtract.306), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-right-logical.165 = u32[50]{0} shift-right-logical(u32[50]{0} %xor.202, u32[50]{0} %broadcast.6638), metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %or.195 = u32[50]{0} or(u32[50]{0} %shift-left.164, u32[50]{0} %shift-right-logical.165), metadata={op_name="jit(step)/jit(main)/while/body/or" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %xor.201 = u32[50]{0} xor(u32[50]{0} %add.1646, u32[50]{0} %or.195), metadata={op_name="jit(step)/jit(main)/while/body/xor" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %add.1645 = u32[50]{0} add(u32[50]{0} %add.1646, u32[50]{0} %xor.201), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %slice.451 = u32[1]{0} slice(u32[4]{0} %param_1.5), slice={[2:3]}, metadata={op_name="jit(step)/jit(main)/while/body/slice[start_indices=(2,) limit_indices=(3,) strides=(1,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %reshape.4229 = u32[] reshape(u32[1]{0} %slice.451), metadata={op_name="jit(step)/jit(main)/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6637 = u32[50]{0} broadcast(u32[] %reshape.4229), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-left.163 = u32[50]{0} shift-left(u32[50]{0} %xor.201, u32[50]{0} %broadcast.6637), metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %subtract.305 = u32[] subtract(u32[] %constant.5073, u32[] %reshape.4229), metadata={op_name="jit(step)/jit(main)/while/body/sub" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6636 = u32[50]{0} broadcast(u32[] %subtract.305), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-right-logical.164 = u32[50]{0} shift-right-logical(u32[50]{0} %xor.201, u32[50]{0} %broadcast.6636), metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %or.194 = u32[50]{0} or(u32[50]{0} %shift-left.163, u32[50]{0} %shift-right-logical.164), metadata={op_name="jit(step)/jit(main)/while/body/or" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %xor.199 = u32[50]{0} xor(u32[50]{0} %add.1645, u32[50]{0} %or.194), metadata={op_name="jit(step)/jit(main)/while/body/xor" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %add.1644 = u32[50]{0} add(u32[50]{0} %add.1645, u32[50]{0} %xor.199), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %slice.450 = u32[1]{0} slice(u32[4]{0} %param_1.5), slice={[3:4]}, metadata={op_name="jit(step)/jit(main)/while/body/slice[start_indices=(3,) limit_indices=(4,) strides=(1,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %reshape.4228 = u32[] reshape(u32[1]{0} %slice.450), metadata={op_name="jit(step)/jit(main)/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6635 = u32[50]{0} broadcast(u32[] %reshape.4228), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-left.162 = u32[50]{0} shift-left(u32[50]{0} %xor.199, u32[50]{0} %broadcast.6635), metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %subtract.304 = u32[] subtract(u32[] %constant.5073, u32[] %reshape.4228), metadata={op_name="jit(step)/jit(main)/while/body/sub" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6634 = u32[50]{0} broadcast(u32[] %subtract.304), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-right-logical.163 = u32[50]{0} shift-right-logical(u32[50]{0} %xor.199, u32[50]{0} %broadcast.6634), metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %or.193 = u32[50]{0} or(u32[50]{0} %shift-left.162, u32[50]{0} %shift-right-logical.163), metadata={op_name="jit(step)/jit(main)/while/body/or" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %xor.198 = u32[50]{0} xor(u32[50]{0} %add.1644, u32[50]{0} %or.193), metadata={op_name="jit(step)/jit(main)/while/body/xor" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %param_0.2 = u32[] parameter(0)
  %broadcast.6632 = u32[50]{0} broadcast(u32[] %param_0.2), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %add.1643 = u32[50]{0} add(u32[50]{0} %xor.198, u32[50]{0} %broadcast.6632), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %param_4.12 = s64[] parameter(4)
  %constant.5074 = s64[] constant(1)
  %add.1648 = s64[] add(s64[] %param_4.12, s64[] %constant.5074), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %convert.248 = u32[] convert(s64[] %add.1648), metadata={op_name="jit(step)/jit(main)/while/body/convert_element_type[new_dtype=uint32 weak_type=False]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6630 = u32[50]{0} broadcast(u32[] %convert.248), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  ROOT %add.1642 = u32[50]{0} add(u32[50]{0} %add.1643, u32[50]{0} %broadcast.6630), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
}

%fused_computation.1 (param_0.4: u32[], param_1.11: u32[4], param_2.14: u32[50], param_3.17: u32[50]) -> u32[50] {
  %param_3.17 = u32[50]{0} parameter(3)
  %param_2.14 = u32[50]{0} parameter(2)
  %add.1653 = u32[50]{0} add(u32[50]{0} %param_3.17, u32[50]{0} %param_2.14), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %param_1.11 = u32[4]{0} parameter(1)
  %slice.456 = u32[1]{0} slice(u32[4]{0} %param_1.11), slice={[0:1]}, metadata={op_name="jit(step)/jit(main)/while/body/slice[start_indices=(0,) limit_indices=(1,) strides=(1,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %reshape.4234 = u32[] reshape(u32[1]{0} %slice.456), metadata={op_name="jit(step)/jit(main)/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6650 = u32[50]{0} broadcast(u32[] %reshape.4234), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-left.168 = u32[50]{0} shift-left(u32[50]{0} %param_2.14, u32[50]{0} %broadcast.6650), metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %constant.5075 = u32[] constant(32)
  %subtract.310 = u32[] subtract(u32[] %constant.5075, u32[] %reshape.4234), metadata={op_name="jit(step)/jit(main)/while/body/sub" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6649 = u32[50]{0} broadcast(u32[] %subtract.310), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-right-logical.169 = u32[50]{0} shift-right-logical(u32[50]{0} %param_2.14, u32[50]{0} %broadcast.6649), metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %or.200 = u32[50]{0} or(u32[50]{0} %shift-left.168, u32[50]{0} %shift-right-logical.169), metadata={op_name="jit(step)/jit(main)/while/body/or" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %xor.205 = u32[50]{0} xor(u32[50]{0} %add.1653, u32[50]{0} %or.200), metadata={op_name="jit(step)/jit(main)/while/body/xor" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %add.1652 = u32[50]{0} add(u32[50]{0} %add.1653, u32[50]{0} %xor.205), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %slice.455 = u32[1]{0} slice(u32[4]{0} %param_1.11), slice={[1:2]}, metadata={op_name="jit(step)/jit(main)/while/body/slice[start_indices=(1,) limit_indices=(2,) strides=(1,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %reshape.4233 = u32[] reshape(u32[1]{0} %slice.455), metadata={op_name="jit(step)/jit(main)/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6648 = u32[50]{0} broadcast(u32[] %reshape.4233), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-left.167 = u32[50]{0} shift-left(u32[50]{0} %xor.205, u32[50]{0} %broadcast.6648), metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %subtract.309 = u32[] subtract(u32[] %constant.5075, u32[] %reshape.4233), metadata={op_name="jit(step)/jit(main)/while/body/sub" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6647 = u32[50]{0} broadcast(u32[] %subtract.309), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-right-logical.168 = u32[50]{0} shift-right-logical(u32[50]{0} %xor.205, u32[50]{0} %broadcast.6647), metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %or.198 = u32[50]{0} or(u32[50]{0} %shift-left.167, u32[50]{0} %shift-right-logical.168), metadata={op_name="jit(step)/jit(main)/while/body/or" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %xor.204 = u32[50]{0} xor(u32[50]{0} %add.1652, u32[50]{0} %or.198), metadata={op_name="jit(step)/jit(main)/while/body/xor" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %add.1651 = u32[50]{0} add(u32[50]{0} %add.1652, u32[50]{0} %xor.204), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %slice.454 = u32[1]{0} slice(u32[4]{0} %param_1.11), slice={[2:3]}, metadata={op_name="jit(step)/jit(main)/while/body/slice[start_indices=(2,) limit_indices=(3,) strides=(1,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %reshape.4232 = u32[] reshape(u32[1]{0} %slice.454), metadata={op_name="jit(step)/jit(main)/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6646 = u32[50]{0} broadcast(u32[] %reshape.4232), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-left.166 = u32[50]{0} shift-left(u32[50]{0} %xor.204, u32[50]{0} %broadcast.6646), metadata={op_name="jit(step)/jit(main)/while/body/shift_left" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %subtract.308 = u32[] subtract(u32[] %constant.5075, u32[] %reshape.4232), metadata={op_name="jit(step)/jit(main)/while/body/sub" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %broadcast.6645 = u32[50]{0} broadcast(u32[] %subtract.308), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %shift-right-logical.167 = u32[50]{0} shift-right-logical(u32[50]{0} %xor.204, u32[50]{0} %broadcast.6645), metadata={op_name="jit(step)/jit(main)/while/body/shift_right_logical" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %or.197 = u32[50]{0} or(u32[50]{0} %shift-left.166, u32[50]{0} %shift-right-logical.167), metadata={op_name="jit(step)/jit(main)/while/body/or" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %xor.203 = u32[50]{0} xor(u32[50]{0} %add.1651, u32[50]{0} %or.197), metadata={op_name="jit(step)/jit(main)/while/body/xor" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %add.1650 = u32[50]{0} add(u32[50]{0} %add.1651, u32[50]{0} %xor.203), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %param_0.4 = u32[] parameter(0)
  %broadcast.6644 = u32[50]{0} broadcast(u32[] %param_0.4), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  ROOT %add.1649 = u32[50]{0} add(u32[50]{0} %add.1650, u32[50]{0} %broadcast.6644), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
}

%region_0.67.clone.clone.clone (arg_tuple.53: (s64[], u32[50], u32[50], u32[], u32[], /*index=5*/u32[], u32[4], u32[4])) -> (s64[], u32[50], u32[50], u32[], u32[], /*index=5*/u32[], u32[4], u32[4]) {
  %arg_tuple.53 = (s64[], u32[50]{0}, u32[50]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.3096 = s64[] get-tuple-element((s64[], u32[50]{0}, u32[50]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) %arg_tuple.53), index=0
  %copy.2558 = s64[] copy(s64[] %get-tuple-element.3096)
  %constant.3322 = s64[] constant(1)
  %add.1125 = s64[] add(s64[] %copy.2558, s64[] %constant.3322), metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %get-tuple-element.3099 = u32[] get-tuple-element((s64[], u32[50]{0}, u32[50]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) %arg_tuple.53), index=3
  %copy.2561 = u32[] copy(u32[] %get-tuple-element.3099)
  %get-tuple-element.3102 = u32[4]{0} get-tuple-element((s64[], u32[50]{0}, u32[50]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) %arg_tuple.53), index=6
  %copy.2564 = u32[4]{0} copy(u32[4]{0} %get-tuple-element.3102)
  %get-tuple-element.3098 = u32[50]{0} get-tuple-element((s64[], u32[50]{0}, u32[50]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) %arg_tuple.53), index=2
  %copy.2560 = u32[50]{0} copy(u32[50]{0} %get-tuple-element.3098)
  %get-tuple-element.3097 = u32[50]{0} get-tuple-element((s64[], u32[50]{0}, u32[50]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) %arg_tuple.53), index=1
  %copy.2559 = u32[50]{0} copy(u32[50]{0} %get-tuple-element.3097)
  %fusion.1 = u32[50]{0} fusion(u32[] %copy.2561, u32[4]{0} %copy.2564, u32[50]{0} %copy.2560, u32[50]{0} %copy.2559), kind=kLoop, calls=%fused_computation.1, metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %get-tuple-element.3100 = u32[] get-tuple-element((s64[], u32[50]{0}, u32[50]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) %arg_tuple.53), index=4
  %copy.2562 = u32[] copy(u32[] %get-tuple-element.3100)
  %fusion = u32[50]{0} fusion(u32[] %copy.2562, u32[4]{0} %copy.2564, u32[50]{0} %copy.2560, u32[50]{0} %copy.2559, s64[] %copy.2558), kind=kLoop, calls=%fused_computation, metadata={op_name="jit(step)/jit(main)/while/body/add" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
  %copy.2569 = u32[] copy(u32[] %copy.2562), control-predecessors={%copy.2561}
  %get-tuple-element.3101 = u32[] get-tuple-element((s64[], u32[50]{0}, u32[50]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) %arg_tuple.53), index=5
  %copy.2563 = u32[] copy(u32[] %get-tuple-element.3101)
  %copy.2570 = u32[] copy(u32[] %copy.2563), control-predecessors={%copy.2562}
  %copy.2571 = u32[] copy(u32[] %copy.2561), control-predecessors={%copy.2563}
  %get-tuple-element.3103 = u32[4]{0} get-tuple-element((s64[], u32[50]{0}, u32[50]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) %arg_tuple.53), index=7
  %copy.2565 = u32[4]{0} copy(u32[4]{0} %get-tuple-element.3103)
  %copy.2572 = u32[4]{0} copy(u32[4]{0} %copy.2565), control-predecessors={%copy.2564}
  %copy.2573 = u32[4]{0} copy(u32[4]{0} %copy.2564), control-predecessors={%copy.2565}
  ROOT %tuple.377 = (s64[], u32[50]{0}, u32[50]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) tuple(s64[] %add.1125, u32[50]{0} %fusion.1, u32[50]{0} %fusion, u32[] %copy.2569, u32[] %copy.2570, /*index=5*/u32[] %copy.2571, u32[4]{0} %copy.2572, u32[4]{0} %copy.2573)
}

%region_1.131.clone.clone (arg_tuple.54: (s64[], u32[50], u32[50], u32[], u32[], /*index=5*/u32[], u32[4], u32[4])) -> pred[] {
  %arg_tuple.54 = (s64[], u32[50]{0}, u32[50]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) parameter(0)
  %get-tuple-element.2308 = s64[] get-tuple-element((s64[], u32[50]{0}, u32[50]{0}, u32[], u32[], /*index=5*/u32[], u32[4]{0}, u32[4]{0}) %arg_tuple.54), index=0
  %constant.3323 = s64[] constant(5)
  ROOT %compare.644 = pred[] compare(s64[] %get-tuple-element.2308, s64[] %constant.3323), direction=LT, metadata={op_name="jit(step)/jit(main)/while/cond/lt" source_file="/home/mathis/repos/backward_ica/src/training.py" source_line=415}
}

%region_20.2929 (Arg_0.2930: f64[], Arg_1.2931: f64[]) -> f64[] {
  %Arg_0.2930 = f64[] parameter(0)
  %Arg_1.2931 = f64[] parameter(1)
  ROOT %add.2932 = f64[] add(f64[] %Arg_0.2930, f64[] %Arg_1.2931), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/vmap(transpose(vmap(jvp(jit(_diag)))))/jit(_where)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=107}
}

%region_21.2946 (Arg_0.2947: f64[], Arg_1.2948: f64[]) -> f64[] {
  %Arg_0.2947 = f64[] parameter(0)
  %Arg_1.2948 = f64[] parameter(1)
  ROOT %add.2949 = f64[] add(f64[] %Arg_0.2947, f64[] %Arg_1.2948), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/vmap(transpose(vmap(jvp(jit(_diag)))))/jit(_where)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=107}
}

%region_12.1754 (Arg_0.1755: f64[], Arg_1.1756: f64[]) -> f64[] {
  %Arg_0.1755 = f64[] parameter(0)
  %Arg_1.1756 = f64[] parameter(1)
  ROOT %add.1757 = f64[] add(f64[] %Arg_0.1755, f64[] %Arg_1.1756), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/vmap(transpose(vmap(jvp(jit(_diag)))))/jit(_where)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=107}
}

%region_13.1771 (Arg_0.1772: f64[], Arg_1.1773: f64[]) -> f64[] {
  %Arg_0.1772 = f64[] parameter(0)
  %Arg_1.1773 = f64[] parameter(1)
  ROOT %add.1774 = f64[] add(f64[] %Arg_0.1772, f64[] %Arg_1.1773), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/vmap(transpose(vmap(jvp(jit(_diag)))))/jit(_where)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=107}
}

%and.reduce_sub_computation.2 (lhs.2: pred[], rhs.2: pred[]) -> pred[] {
  %lhs.2 = pred[] parameter(0)
  %rhs.2 = pred[] parameter(1)
  ROOT %and.5 = pred[] and(pred[] %lhs.2, pred[] %rhs.2)
}

%fused_computation.2 (param_0.5: f64[5,5], param_1.15: f64[5], param_2.19: s32[], param_3.24: s32[2], param_4.37: s32[5,2]) -> f64[5,5] {
  %param_0.5 = f64[5,5]{1,0} parameter(0)
  %constant.5078 = s32[] constant(0)
  %broadcast.6652 = s32[2]{0} broadcast(s32[] %constant.5078), dimensions={}
  %param_3.24 = s32[2]{0} parameter(3)
  %compare.1026 = pred[2]{0} compare(s32[2]{0} %broadcast.6652, s32[2]{0} %param_3.24), direction=LE
  %constant.5077 = s32[] constant(4)
  %broadcast.6651 = s32[2]{0} broadcast(s32[] %constant.5077), dimensions={}
  %compare.1024 = pred[2]{0} compare(s32[2]{0} %broadcast.6651, s32[2]{0} %param_3.24), direction=GE
  %and.54 = pred[2]{0} and(pred[2]{0} %compare.1026, pred[2]{0} %compare.1024)
  %constant.5076 = pred[] constant(true)
  %reduce.145 = pred[] reduce(pred[2]{0} %and.54, pred[] %constant.5076), dimensions={0}, to_apply=%and.reduce_sub_computation.2
  %reshape.4238 = pred[1,1]{1,0} reshape(pred[] %reduce.145)
  %param_4.37 = s32[5,2]{1,0} parameter(4)
  %param_2.19 = s32[] parameter(2)
  %dynamic-slice.32 = s32[1,2]{1,0} dynamic-slice(s32[5,2]{1,0} %param_4.37, s32[] %param_2.19, s32[] %constant.5078), dynamic_slice_sizes={1,2}
  %slice.458 = s32[1,1]{1,0} slice(s32[1,2]{1,0} %dynamic-slice.32), slice={[0:1], [0:1]}
  %reshape.4237 = s32[] reshape(s32[1,1]{1,0} %slice.458)
  %reshape.4239 = s32[2]{0} reshape(s32[1,2]{1,0} %dynamic-slice.32)
  %slice.457 = s32[1]{0} slice(s32[2]{0} %reshape.4239), slice={[1:2]}
  %reshape.4236 = s32[] reshape(s32[1]{0} %slice.457)
  %dynamic-slice.31 = f64[1,1]{1,0} dynamic-slice(f64[5,5]{1,0} %param_0.5, s32[] %reshape.4237, s32[] %reshape.4236), dynamic_slice_sizes={1,1}
  %param_1.15 = f64[5]{0} parameter(1)
  %dynamic-slice.30 = f64[1]{0} dynamic-slice(f64[5]{0} %param_1.15, s32[] %param_2.19), dynamic_slice_sizes={1}
  %reshape.4235 = f64[1,1]{1,0} reshape(f64[1]{0} %dynamic-slice.30)
  %add.1654 = f64[1,1]{1,0} add(f64[1,1]{1,0} %dynamic-slice.31, f64[1,1]{1,0} %reshape.4235), metadata={op_name="/add" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=211}
  %select.1860 = f64[1,1]{1,0} select(pred[1,1]{1,0} %reshape.4238, f64[1,1]{1,0} %add.1654, f64[1,1]{1,0} %dynamic-slice.31)
  ROOT %dynamic-update-slice.86 = f64[5,5]{1,0} dynamic-update-slice(f64[5,5]{1,0} %param_0.5, f64[1,1]{1,0} %select.1860, s32[] %reshape.4237, s32[] %reshape.4236)
}

%fused_computation.3 (param_0.8: s32[5,2], param_1.20: s32[]) -> s32[2] {
  %param_0.8 = s32[5,2]{1,0} parameter(0)
  %param_1.20 = s32[] parameter(1)
  %constant.5079 = s32[] constant(0)
  %dynamic-slice.33 = s32[1,2]{1,0} dynamic-slice(s32[5,2]{1,0} %param_0.8, s32[] %param_1.20, s32[] %constant.5079), dynamic_slice_sizes={1,2}
  %slice.460 = s32[1,1]{1,0} slice(s32[1,2]{1,0} %dynamic-slice.33), slice={[0:1], [0:1]}
  %reshape.4241 = s32[1]{0} reshape(s32[1,1]{1,0} %slice.460)
  %reshape.4240 = s32[2]{0} reshape(s32[1,2]{1,0} %dynamic-slice.33)
  %slice.459 = s32[1]{0} slice(s32[2]{0} %reshape.4240), slice={[1:2]}
  ROOT %concatenate.54 = s32[2]{0} concatenate(s32[1]{0} %reshape.4241, s32[1]{0} %slice.459), dimensions={0}
}

%while_body.2 (param.4: (s32[], f64[5,5], s32[5,2], f64[5])) -> (s32[], f64[5,5], s32[5,2], f64[5]) {
  %param.4 = (s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) parameter(0)
  %get-tuple-element.2835 = s32[] get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.4), index=0
  %copy.2154 = s32[] copy(s32[] %get-tuple-element.2835)
  %constant.2595 = s32[] constant(1)
  %add.543 = s32[] add(s32[] %copy.2154, s32[] %constant.2595)
  %get-tuple-element.2836 = f64[5,5]{1,0} get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.4), index=1
  %get-tuple-element.2842 = f64[5]{0} get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.4), index=3
  %get-tuple-element.2841 = s32[5,2]{1,0} get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.4), index=2
  %fusion.3 = s32[2]{0} fusion(s32[5,2]{1,0} %get-tuple-element.2841, s32[] %copy.2154), kind=kLoop, calls=%fused_computation.3
  %fusion.2 = f64[5,5]{1,0} fusion(f64[5,5]{1,0} %get-tuple-element.2836, f64[5]{0} %get-tuple-element.2842, s32[] %copy.2154, s32[2]{0} %fusion.3, s32[5,2]{1,0} %get-tuple-element.2841), kind=kLoop, calls=%fused_computation.2
  ROOT %tuple.345 = (s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) tuple(s32[] %add.543, f64[5,5]{1,0} %fusion.2, s32[5,2]{1,0} %get-tuple-element.2841, f64[5]{0} %get-tuple-element.2842)
}

%while_cond.2 (param.5: (s32[], f64[5,5], s32[5,2], f64[5])) -> pred[] {
  %param.5 = (s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) parameter(0)
  %get-tuple-element.246 = s32[] get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.5), index=0
  %constant.2603 = s32[] constant(5)
  ROOT %compare.490 = pred[] compare(s32[] %get-tuple-element.246, s32[] %constant.2603), direction=LT
}

%fused_computation.4 (param_0.11: u32[], param_1.26: u32[4], param_2.27: u32[100], param_3.32: u32[100], param_4.50: s64[]) -> u32[100] {
  %param_3.32 = u32[100]{0} parameter(3)
  %param_2.27 = u32[100]{0} parameter(2)
  %add.1661 = u32[100]{0} add(u32[100]{0} %param_3.32, u32[100]{0} %param_2.27), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/add" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %param_1.26 = u32[4]{0} parameter(1)
  %slice.464 = u32[1]{0} slice(u32[4]{0} %param_1.26), slice={[0:1]}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/slice[start_indices=(0,) limit_indices=(1,) strides=(1,)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %reshape.4245 = u32[] reshape(u32[1]{0} %slice.464), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %broadcast.6662 = u32[100]{0} broadcast(u32[] %reshape.4245), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_left" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %shift-left.172 = u32[100]{0} shift-left(u32[100]{0} %param_2.27, u32[100]{0} %broadcast.6662), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_left" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %constant.5081 = u32[] constant(32)
  %subtract.314 = u32[] subtract(u32[] %constant.5081, u32[] %reshape.4245), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/sub" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %broadcast.6661 = u32[100]{0} broadcast(u32[] %subtract.314), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_right_logical" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %shift-right-logical.173 = u32[100]{0} shift-right-logical(u32[100]{0} %param_2.27, u32[100]{0} %broadcast.6661), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_right_logical" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %or.204 = u32[100]{0} or(u32[100]{0} %shift-left.172, u32[100]{0} %shift-right-logical.173), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/or" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %xor.209 = u32[100]{0} xor(u32[100]{0} %add.1661, u32[100]{0} %or.204), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/xor" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %add.1660 = u32[100]{0} add(u32[100]{0} %add.1661, u32[100]{0} %xor.209), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/add" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %slice.463 = u32[1]{0} slice(u32[4]{0} %param_1.26), slice={[1:2]}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/slice[start_indices=(1,) limit_indices=(2,) strides=(1,)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %reshape.4244 = u32[] reshape(u32[1]{0} %slice.463), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %broadcast.6660 = u32[100]{0} broadcast(u32[] %reshape.4244), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_left" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %shift-left.171 = u32[100]{0} shift-left(u32[100]{0} %xor.209, u32[100]{0} %broadcast.6660), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_left" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %subtract.313 = u32[] subtract(u32[] %constant.5081, u32[] %reshape.4244), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/sub" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %broadcast.6659 = u32[100]{0} broadcast(u32[] %subtract.313), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_right_logical" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %shift-right-logical.172 = u32[100]{0} shift-right-logical(u32[100]{0} %xor.209, u32[100]{0} %broadcast.6659), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_right_logical" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %or.203 = u32[100]{0} or(u32[100]{0} %shift-left.171, u32[100]{0} %shift-right-logical.172), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/or" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %xor.208 = u32[100]{0} xor(u32[100]{0} %add.1660, u32[100]{0} %or.203), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/xor" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %add.1659 = u32[100]{0} add(u32[100]{0} %add.1660, u32[100]{0} %xor.208), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/add" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %slice.462 = u32[1]{0} slice(u32[4]{0} %param_1.26), slice={[2:3]}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/slice[start_indices=(2,) limit_indices=(3,) strides=(1,)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %reshape.4243 = u32[] reshape(u32[1]{0} %slice.462), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %broadcast.6658 = u32[100]{0} broadcast(u32[] %reshape.4243), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_left" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %shift-left.170 = u32[100]{0} shift-left(u32[100]{0} %xor.208, u32[100]{0} %broadcast.6658), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_left" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %subtract.312 = u32[] subtract(u32[] %constant.5081, u32[] %reshape.4243), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/sub" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %broadcast.6657 = u32[100]{0} broadcast(u32[] %subtract.312), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_right_logical" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %shift-right-logical.171 = u32[100]{0} shift-right-logical(u32[100]{0} %xor.208, u32[100]{0} %broadcast.6657), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_right_logical" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %or.202 = u32[100]{0} or(u32[100]{0} %shift-left.170, u32[100]{0} %shift-right-logical.171), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/or" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %xor.207 = u32[100]{0} xor(u32[100]{0} %add.1659, u32[100]{0} %or.202), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/xor" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %add.1657 = u32[100]{0} add(u32[100]{0} %add.1659, u32[100]{0} %xor.207), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/add" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %slice.461 = u32[1]{0} slice(u32[4]{0} %param_1.26), slice={[3:4]}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/slice[start_indices=(3,) limit_indices=(4,) strides=(1,)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %reshape.4242 = u32[] reshape(u32[1]{0} %slice.461), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %broadcast.6656 = u32[100]{0} broadcast(u32[] %reshape.4242), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_left" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %shift-left.169 = u32[100]{0} shift-left(u32[100]{0} %xor.207, u32[100]{0} %broadcast.6656), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_left" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %subtract.311 = u32[] subtract(u32[] %constant.5081, u32[] %reshape.4242), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/sub" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %broadcast.6655 = u32[100]{0} broadcast(u32[] %subtract.311), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_right_logical" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %shift-right-logical.170 = u32[100]{0} shift-right-logical(u32[100]{0} %xor.207, u32[100]{0} %broadcast.6655), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_right_logical" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %or.201 = u32[100]{0} or(u32[100]{0} %shift-left.169, u32[100]{0} %shift-right-logical.170), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/or" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %xor.206 = u32[100]{0} xor(u32[100]{0} %add.1657, u32[100]{0} %or.201), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/xor" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %param_0.11 = u32[] parameter(0)
  %broadcast.6654 = u32[100]{0} broadcast(u32[] %param_0.11), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/add" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %add.1656 = u32[100]{0} add(u32[100]{0} %xor.206, u32[100]{0} %broadcast.6654), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/add" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %param_4.50 = s64[] parameter(4)
  %constant.5083 = s64[] constant(1)
  %add.1662 = s64[] add(s64[] %param_4.50, s64[] %constant.5083), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/add" source_file="/home/mathis/repos/backward_ica/src/online_smoothing.py" source_line=621}
  %convert.249 = u32[] convert(s64[] %add.1662), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/convert_element_type[new_dtype=uint32 weak_type=False]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %broadcast.6653 = u32[100]{0} broadcast(u32[] %convert.249), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/add" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  ROOT %add.1655 = u32[100]{0} add(u32[100]{0} %add.1656, u32[100]{0} %broadcast.6653), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/add" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
}

%fused_computation.5 (param_0.13: u32[], param_1.32: u32[4], param_2.35: u32[100], param_3.42: u32[100]) -> u32[100] {
  %param_3.42 = u32[100]{0} parameter(3)
  %param_2.35 = u32[100]{0} parameter(2)
  %add.1667 = u32[100]{0} add(u32[100]{0} %param_3.42, u32[100]{0} %param_2.35), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/add" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %param_1.32 = u32[4]{0} parameter(1)
  %slice.467 = u32[1]{0} slice(u32[4]{0} %param_1.32), slice={[0:1]}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/slice[start_indices=(0,) limit_indices=(1,) strides=(1,)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %reshape.4248 = u32[] reshape(u32[1]{0} %slice.467), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %broadcast.6669 = u32[100]{0} broadcast(u32[] %reshape.4248), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_left" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %shift-left.176 = u32[100]{0} shift-left(u32[100]{0} %param_2.35, u32[100]{0} %broadcast.6669), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_left" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %constant.5084 = u32[] constant(32)
  %subtract.317 = u32[] subtract(u32[] %constant.5084, u32[] %reshape.4248), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/sub" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %broadcast.6668 = u32[100]{0} broadcast(u32[] %subtract.317), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_right_logical" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %shift-right-logical.176 = u32[100]{0} shift-right-logical(u32[100]{0} %param_2.35, u32[100]{0} %broadcast.6668), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_right_logical" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %or.207 = u32[100]{0} or(u32[100]{0} %shift-left.176, u32[100]{0} %shift-right-logical.176), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/or" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %xor.213 = u32[100]{0} xor(u32[100]{0} %add.1667, u32[100]{0} %or.207), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/xor" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %add.1666 = u32[100]{0} add(u32[100]{0} %add.1667, u32[100]{0} %xor.213), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/add" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %slice.466 = u32[1]{0} slice(u32[4]{0} %param_1.32), slice={[1:2]}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/slice[start_indices=(1,) limit_indices=(2,) strides=(1,)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %reshape.4247 = u32[] reshape(u32[1]{0} %slice.466), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/squeeze[dimensions=(0,)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %broadcast.6667 = u32[100]{0} broadcast(u32[] %reshape.4247), dimensions={}, metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_left" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %shift-left.174 = u32[100]{0} shift-left(u32[100]{0} %xor.213, u32[100]{0} %broadcast.6667), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/shift_left" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
  %subtract.316 = u32[] subtract(u32[] %constant.5084, u32[] %reshape.4247), metadata={op_name="jit(step)/jit(main)/while/body/cond/branch_0_fun/while/body/sub" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/initializers.py" source_line=88}
