HloModule jit__update, entry_computation_layout={(f64[5]{0}, f64[5,5]{1,0}, f64[100]{0}, f64[100]{0}, f64[5,5]{1,0}, /*index=5*/f64[5]{0}, f64[5,5]{1,0}, f64[5,5]{1,0}, f64[5]{0}, f64[5,5]{1,0}, /*index=10*/f64[100,5]{1,0}, u32[2]{0}, f64[5]{0}, f64[5]{0}, f64[100]{0}, /*index=15*/f64[5,100]{1,0}, f64[10]{0}, f64[100,10]{1,0}, f64[1,5]{1,0})->(f64[5]{0}, f64[5,5]{1,0}, f64[100,5]{1,0}, f64[100,5]{1,0}, f64[100,5]{1,0}, /*index=5*/f64[100,5]{1,0}, f64[100,100]{1,0}, f64[100,5,100]{2,1,0}, f64[100,10]{1,0}, f64[100,100,10]{2,1,0}, /*index=10*/f64[100,5]{1,0}, f64[100,5]{1,0}, f64[100,5]{1,0}, f64[100,5]{1,0}, f64[100,100]{1,0}, /*index=15*/f64[100,5,100]{2,1,0}, f64[100,10]{1,0}, f64[100,100,10]{2,1,0}, f64[100]{0}, f64[100]{0}, /*index=20*/f64[100,5]{1,0}, f64[5]{0}, f64[5,5]{1,0}, f64[5,5]{1,0}, f64[5]{0}, /*index=25*/f64[5,5]{1,0})}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}

%region_4.1842 (Arg_0.1843: f64[], Arg_1.1844: f64[]) -> f64[] {
  %Arg_0.1843 = f64[] parameter(0)
  %Arg_1.1844 = f64[] parameter(1)
  ROOT %add.1845 = f64[] add(f64[] %Arg_0.1843, f64[] %Arg_1.1844), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=88}
}

%region_5.1854 (Arg_0.1855: f64[], Arg_1.1856: f64[]) -> f64[] {
  %Arg_0.1855 = f64[] parameter(0)
  %Arg_1.1856 = f64[] parameter(1)
  ROOT %add.1857 = f64[] add(f64[] %Arg_0.1855, f64[] %Arg_1.1856), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
}

%region_6.1862 (Arg_0.1863: f64[], Arg_1.1864: f64[]) -> f64[] {
  %Arg_0.1863 = f64[] parameter(0)
  %Arg_1.1864 = f64[] parameter(1)
  ROOT %add.1865 = f64[] add(f64[] %Arg_0.1863, f64[] %Arg_1.1864), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=107}
}

%region_16.4197 (Arg_0.4198: f64[], Arg_1.4199: f64[]) -> f64[] {
  %Arg_0.4198 = f64[] parameter(0)
  %Arg_1.4199 = f64[] parameter(1)
  ROOT %add.4200 = f64[] add(f64[] %Arg_0.4198, f64[] %Arg_1.4199), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(2,)]" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=88}
}

%region_17.4209 (Arg_0.4210: f64[], Arg_1.4211: f64[]) -> f64[] {
  %Arg_0.4210 = f64[] parameter(0)
  %Arg_1.4211 = f64[] parameter(1)
  ROOT %add.4212 = f64[] add(f64[] %Arg_0.4210, f64[] %Arg_1.4211), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(2,)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
}

%region_18.4217 (Arg_0.4218: f64[], Arg_1.4219: f64[]) -> f64[] {
  %Arg_0.4218 = f64[] parameter(0)
  %Arg_1.4219 = f64[] parameter(1)
  ROOT %add.4220 = f64[] add(f64[] %Arg_0.4218, f64[] %Arg_1.4219), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(2,)]" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=107}
}

%region_23.5425 (Arg_0.5426: f64[], Arg_1.5427: f64[]) -> f64[] {
  %Arg_0.5426 = f64[] parameter(0)
  %Arg_1.5427 = f64[] parameter(1)
  ROOT %add.5428 = f64[] add(f64[] %Arg_0.5426, f64[] %Arg_1.5427), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(2,)]" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=107}
}

%region_24.5615 (Arg_0.5616: f64[], Arg_1.5617: f64[]) -> f64[] {
  %Arg_0.5616 = f64[] parameter(0)
  %Arg_1.5617 = f64[] parameter(1)
  ROOT %add.5618 = f64[] add(f64[] %Arg_0.5616, f64[] %Arg_1.5617), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(2,)]" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=88}
}

%region_25.5630 (Arg_0.5631: f64[], Arg_1.5632: f64[]) -> f64[] {
  %Arg_0.5631 = f64[] parameter(0)
  %Arg_1.5632 = f64[] parameter(1)
  ROOT %add.5633 = f64[] add(f64[] %Arg_0.5631, f64[] %Arg_1.5632), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(2,)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
}

%region_26.5729 (Arg_0.5730: f64[], Arg_1.5731: f64[]) -> f64[] {
  %Arg_0.5730 = f64[] parameter(0)
  %Arg_1.5731 = f64[] parameter(1)
  ROOT %add.5732 = f64[] add(f64[] %Arg_0.5730, f64[] %Arg_1.5731), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/online_smoothing.py" source_line=835}
}

%region_28.5741 (Arg_0.5742: f64[], Arg_1.5743: f64[]) -> f64[] {
  %Arg_0.5742 = f64[] parameter(0)
  %Arg_1.5743 = f64[] parameter(1)
  ROOT %add.5744 = f64[] add(f64[] %Arg_0.5742, f64[] %Arg_1.5743), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/online_smoothing.py" source_line=835}
}

%region_29.5747 (Arg_0.5748: f64[], Arg_1.5749: f64[]) -> f64[] {
  %Arg_0.5748 = f64[] parameter(0)
  %Arg_1.5749 = f64[] parameter(1)
  ROOT %add.5750 = f64[] add(f64[] %Arg_0.5748, f64[] %Arg_1.5749), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/online_smoothing.py" source_line=835}
}

%region_30.5753 (Arg_0.5754: f64[], Arg_1.5755: f64[]) -> f64[] {
  %Arg_0.5754 = f64[] parameter(0)
  %Arg_1.5755 = f64[] parameter(1)
  ROOT %add.5756 = f64[] add(f64[] %Arg_0.5754, f64[] %Arg_1.5755), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/online_smoothing.py" source_line=835}
}

%region_32.5765 (Arg_0.5766: f64[], Arg_1.5767: f64[]) -> f64[] {
  %Arg_0.5766 = f64[] parameter(0)
  %Arg_1.5767 = f64[] parameter(1)
  ROOT %add.5768 = f64[] add(f64[] %Arg_0.5766, f64[] %Arg_1.5767), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/online_smoothing.py" source_line=835}
}

%and.reduce_sub_computation.3 (lhs.3: pred[], rhs.3: pred[]) -> pred[] {
  %lhs.3 = pred[] parameter(0)
  %rhs.3 = pred[] parameter(1)
  ROOT %and.6 = pred[] and(pred[] %lhs.3, pred[] %rhs.3)
}

%fused_computation (param_0: f64[5,5], param_1.3: f64[5], param_2.4: s32[], param_3.6: s32[2], param_4.8: s32[5,2]) -> f64[5,5] {
  %param_0 = f64[5,5]{1,0} parameter(0)
  %constant.470 = s32[] constant(0)
  %broadcast.863 = s32[2]{0} broadcast(s32[] %constant.470), dimensions={}
  %param_3.6 = s32[2]{0} parameter(3)
  %compare.53 = pred[2]{0} compare(s32[2]{0} %broadcast.863, s32[2]{0} %param_3.6), direction=LE
  %constant.469 = s32[] constant(4)
  %broadcast.861 = s32[2]{0} broadcast(s32[] %constant.469), dimensions={}
  %compare.52 = pred[2]{0} compare(s32[2]{0} %broadcast.861, s32[2]{0} %param_3.6), direction=GE
  %and.22 = pred[2]{0} and(pred[2]{0} %compare.53, pred[2]{0} %compare.52)
  %constant.468 = pred[] constant(true)
  %reduce.14 = pred[] reduce(pred[2]{0} %and.22, pred[] %constant.468), dimensions={0}, to_apply=%and.reduce_sub_computation.3
  %reshape.2013 = pred[1,1]{1,0} reshape(pred[] %reduce.14)
  %param_4.8 = s32[5,2]{1,0} parameter(4)
  %param_2.4 = s32[] parameter(2)
  %dynamic-slice.22 = s32[1,2]{1,0} dynamic-slice(s32[5,2]{1,0} %param_4.8, s32[] %param_2.4, s32[] %constant.470), dynamic_slice_sizes={1,2}
  %slice.99 = s32[1,1]{1,0} slice(s32[1,2]{1,0} %dynamic-slice.22), slice={[0:1], [0:1]}
  %reshape.2012 = s32[] reshape(s32[1,1]{1,0} %slice.99)
  %reshape.2014 = s32[2]{0} reshape(s32[1,2]{1,0} %dynamic-slice.22)
  %slice.98 = s32[1]{0} slice(s32[2]{0} %reshape.2014), slice={[1:2]}
  %reshape.2011 = s32[] reshape(s32[1]{0} %slice.98)
  %dynamic-slice.21 = f64[1,1]{1,0} dynamic-slice(f64[5,5]{1,0} %param_0, s32[] %reshape.2012, s32[] %reshape.2011), dynamic_slice_sizes={1,1}
  %param_1.3 = f64[5]{0} parameter(1)
  %dynamic-slice.20 = f64[1]{0} dynamic-slice(f64[5]{0} %param_1.3, s32[] %param_2.4), dynamic_slice_sizes={1}
  %reshape.2010 = f64[1,1]{1,0} reshape(f64[1]{0} %dynamic-slice.20)
  %add.90 = f64[1,1]{1,0} add(f64[1,1]{1,0} %dynamic-slice.21, f64[1,1]{1,0} %reshape.2010), metadata={op_name="/add" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=211}
  %select.63 = f64[1,1]{1,0} select(pred[1,1]{1,0} %reshape.2013, f64[1,1]{1,0} %add.90, f64[1,1]{1,0} %dynamic-slice.21)
  ROOT %dynamic-update-slice.6 = f64[5,5]{1,0} dynamic-update-slice(f64[5,5]{1,0} %param_0, f64[1,1]{1,0} %select.63, s32[] %reshape.2012, s32[] %reshape.2011)
}

%fused_computation.1 (param_0.3: s32[5,2], param_1.8: s32[]) -> s32[2] {
  %param_0.3 = s32[5,2]{1,0} parameter(0)
  %param_1.8 = s32[] parameter(1)
  %constant.471 = s32[] constant(0)
  %dynamic-slice.23 = s32[1,2]{1,0} dynamic-slice(s32[5,2]{1,0} %param_0.3, s32[] %param_1.8, s32[] %constant.471), dynamic_slice_sizes={1,2}
  %slice.101 = s32[1,1]{1,0} slice(s32[1,2]{1,0} %dynamic-slice.23), slice={[0:1], [0:1]}
  %reshape.2016 = s32[1]{0} reshape(s32[1,1]{1,0} %slice.101)
  %reshape.2015 = s32[2]{0} reshape(s32[1,2]{1,0} %dynamic-slice.23)
  %slice.100 = s32[1]{0} slice(s32[2]{0} %reshape.2015), slice={[1:2]}
  ROOT %concatenate.16 = s32[2]{0} concatenate(s32[1]{0} %reshape.2016, s32[1]{0} %slice.100), dimensions={0}
}

%while_body.3 (param.6: (s32[], f64[5,5], s32[5,2], f64[5])) -> (s32[], f64[5,5], s32[5,2], f64[5]) {
  %param.6 = (s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) parameter(0)
  %get-tuple-element.94 = s32[] get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.6), index=0
  %copy.1464 = s32[] copy(s32[] %get-tuple-element.94)
  %constant.71 = s32[] constant(1)
  %add.21 = s32[] add(s32[] %copy.1464, s32[] %constant.71)
  %get-tuple-element.95 = f64[5,5]{1,0} get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.6), index=1
  %get-tuple-element.101 = f64[5]{0} get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.6), index=3
  %get-tuple-element.100 = s32[5,2]{1,0} get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.6), index=2
  %fusion.1 = s32[2]{0} fusion(s32[5,2]{1,0} %get-tuple-element.100, s32[] %copy.1464), kind=kLoop, calls=%fused_computation.1
  %fusion = f64[5,5]{1,0} fusion(f64[5,5]{1,0} %get-tuple-element.95, f64[5]{0} %get-tuple-element.101, s32[] %copy.1464, s32[2]{0} %fusion.1, s32[5,2]{1,0} %get-tuple-element.100), kind=kLoop, calls=%fused_computation
  ROOT %tuple.25 = (s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) tuple(s32[] %add.21, f64[5,5]{1,0} %fusion, s32[5,2]{1,0} %get-tuple-element.100, f64[5]{0} %get-tuple-element.101)
}

%while_cond.3 (param.7: (s32[], f64[5,5], s32[5,2], f64[5])) -> pred[] {
  %param.7 = (s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) parameter(0)
  %get-tuple-element.28 = s32[] get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.7), index=0
  %constant.87 = s32[] constant(5)
  ROOT %compare.11 = pred[] compare(s32[] %get-tuple-element.28, s32[] %constant.87), direction=LT
}

%and.reduce_sub_computation.5 (lhs.5: pred[], rhs.5: pred[]) -> pred[] {
  %lhs.5 = pred[] parameter(0)
  %rhs.5 = pred[] parameter(1)
  ROOT %and.10 = pred[] and(pred[] %lhs.5, pred[] %rhs.5)
}

%fused_computation.2 (param_0.4: f64[5,5], param_1.12: f64[5], param_2.10: s32[], param_3.13: s32[2], param_4.17: s32[5,2]) -> f64[5,5] {
  %param_0.4 = f64[5,5]{1,0} parameter(0)
  %constant.474 = s32[] constant(0)
  %broadcast.866 = s32[2]{0} broadcast(s32[] %constant.474), dimensions={}
  %param_3.13 = s32[2]{0} parameter(3)
  %compare.55 = pred[2]{0} compare(s32[2]{0} %broadcast.866, s32[2]{0} %param_3.13), direction=LE
  %constant.473 = s32[] constant(4)
  %broadcast.865 = s32[2]{0} broadcast(s32[] %constant.473), dimensions={}
  %compare.54 = pred[2]{0} compare(s32[2]{0} %broadcast.865, s32[2]{0} %param_3.13), direction=GE
  %and.23 = pred[2]{0} and(pred[2]{0} %compare.55, pred[2]{0} %compare.54)
  %constant.472 = pred[] constant(true)
  %reduce.15 = pred[] reduce(pred[2]{0} %and.23, pred[] %constant.472), dimensions={0}, to_apply=%and.reduce_sub_computation.5
  %reshape.2020 = pred[1,1]{1,0} reshape(pred[] %reduce.15)
  %param_4.17 = s32[5,2]{1,0} parameter(4)
  %param_2.10 = s32[] parameter(2)
  %dynamic-slice.26 = s32[1,2]{1,0} dynamic-slice(s32[5,2]{1,0} %param_4.17, s32[] %param_2.10, s32[] %constant.474), dynamic_slice_sizes={1,2}
  %slice.103 = s32[1,1]{1,0} slice(s32[1,2]{1,0} %dynamic-slice.26), slice={[0:1], [0:1]}
  %reshape.2019 = s32[] reshape(s32[1,1]{1,0} %slice.103)
  %reshape.2021 = s32[2]{0} reshape(s32[1,2]{1,0} %dynamic-slice.26)
  %slice.102 = s32[1]{0} slice(s32[2]{0} %reshape.2021), slice={[1:2]}
  %reshape.2018 = s32[] reshape(s32[1]{0} %slice.102)
  %dynamic-slice.25 = f64[1,1]{1,0} dynamic-slice(f64[5,5]{1,0} %param_0.4, s32[] %reshape.2019, s32[] %reshape.2018), dynamic_slice_sizes={1,1}
  %param_1.12 = f64[5]{0} parameter(1)
  %dynamic-slice.24 = f64[1]{0} dynamic-slice(f64[5]{0} %param_1.12, s32[] %param_2.10), dynamic_slice_sizes={1}
  %reshape.2017 = f64[1,1]{1,0} reshape(f64[1]{0} %dynamic-slice.24)
  %add.91 = f64[1,1]{1,0} add(f64[1,1]{1,0} %dynamic-slice.25, f64[1,1]{1,0} %reshape.2017), metadata={op_name="/add" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=211}
  %select.64 = f64[1,1]{1,0} select(pred[1,1]{1,0} %reshape.2020, f64[1,1]{1,0} %add.91, f64[1,1]{1,0} %dynamic-slice.25)
  ROOT %dynamic-update-slice.7 = f64[5,5]{1,0} dynamic-update-slice(f64[5,5]{1,0} %param_0.4, f64[1,1]{1,0} %select.64, s32[] %reshape.2019, s32[] %reshape.2018)
}

%fused_computation.3 (param_0.7: s32[5,2], param_1.17: s32[]) -> s32[2] {
  %param_0.7 = s32[5,2]{1,0} parameter(0)
  %param_1.17 = s32[] parameter(1)
  %constant.475 = s32[] constant(0)
  %dynamic-slice.27 = s32[1,2]{1,0} dynamic-slice(s32[5,2]{1,0} %param_0.7, s32[] %param_1.17, s32[] %constant.475), dynamic_slice_sizes={1,2}
  %slice.105 = s32[1,1]{1,0} slice(s32[1,2]{1,0} %dynamic-slice.27), slice={[0:1], [0:1]}
  %reshape.2023 = s32[1]{0} reshape(s32[1,1]{1,0} %slice.105)
  %reshape.2022 = s32[2]{0} reshape(s32[1,2]{1,0} %dynamic-slice.27)
  %slice.104 = s32[1]{0} slice(s32[2]{0} %reshape.2022), slice={[1:2]}
  ROOT %concatenate.17 = s32[2]{0} concatenate(s32[1]{0} %reshape.2023, s32[1]{0} %slice.104), dimensions={0}
}

%while_body.5 (param.10: (s32[], f64[5,5], s32[5,2], f64[5])) -> (s32[], f64[5,5], s32[5,2], f64[5]) {
  %param.10 = (s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) parameter(0)
  %get-tuple-element.106 = s32[] get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.10), index=0
  %copy.1499 = s32[] copy(s32[] %get-tuple-element.106)
  %constant.125 = s32[] constant(1)
  %add.23 = s32[] add(s32[] %copy.1499, s32[] %constant.125)
  %get-tuple-element.107 = f64[5,5]{1,0} get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.10), index=1
  %get-tuple-element.113 = f64[5]{0} get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.10), index=3
  %get-tuple-element.112 = s32[5,2]{1,0} get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.10), index=2
  %fusion.3 = s32[2]{0} fusion(s32[5,2]{1,0} %get-tuple-element.112, s32[] %copy.1499), kind=kLoop, calls=%fused_computation.3
  %fusion.2 = f64[5,5]{1,0} fusion(f64[5,5]{1,0} %get-tuple-element.107, f64[5]{0} %get-tuple-element.113, s32[] %copy.1499, s32[2]{0} %fusion.3, s32[5,2]{1,0} %get-tuple-element.112), kind=kLoop, calls=%fused_computation.2
  ROOT %tuple.28 = (s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) tuple(s32[] %add.23, f64[5,5]{1,0} %fusion.2, s32[5,2]{1,0} %get-tuple-element.112, f64[5]{0} %get-tuple-element.113)
}

%while_cond.5 (param.11: (s32[], f64[5,5], s32[5,2], f64[5])) -> pred[] {
  %param.11 = (s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) parameter(0)
  %get-tuple-element.44 = s32[] get-tuple-element((s32[], f64[5,5]{1,0}, s32[5,2]{1,0}, f64[5]{0}) %param.11), index=0
  %constant.141 = s32[] constant(5)
  ROOT %compare.17 = pred[] compare(s32[] %get-tuple-element.44, s32[] %constant.141), direction=LT
}

%region_8.2589 (Arg_0.2590: f64[], Arg_1.2591: f64[]) -> f64[] {
  %Arg_0.2590 = f64[] parameter(0)
  %Arg_1.2591 = f64[] parameter(1)
  ROOT %maximum.2592 = f64[] maximum(f64[] %Arg_0.2590, f64[] %Arg_1.2591), metadata={op_name="jit(_update)/jit(main)/reduce_max[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=621}
}

%region_9.2600 (Arg_0.2601: f64[], Arg_1.2602: f64[]) -> f64[] {
  %Arg_0.2601 = f64[] parameter(0)
  %Arg_1.2602 = f64[] parameter(1)
  ROOT %add.2603 = f64[] add(f64[] %Arg_0.2601, f64[] %Arg_1.2602), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=622}
}

%region_31.5759 (Arg_0.5760: f64[], Arg_1.5761: f64[]) -> f64[] {
  %Arg_0.5760 = f64[] parameter(0)
  %Arg_1.5761 = f64[] parameter(1)
  ROOT %add.5762 = f64[] add(f64[] %Arg_0.5760, f64[] %Arg_1.5761), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/mathis/repos/backward_ica/src/online_smoothing.py" source_line=835}
}

%fused_computation.4 (param_0.9: f64[], param_1.22: f64[100]) -> f64[100] {
  %param_1.22 = f64[100]{0} parameter(1)
  %constant.477 = f64[] constant(-0.5)
  %broadcast.871 = f64[100]{0} broadcast(f64[] %constant.477), dimensions={}, metadata={op_name="jit(_update)/jit(main)/mul" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=211}
  %multiply.171 = f64[100]{0} multiply(f64[100]{0} %param_1.22, f64[100]{0} %broadcast.871), metadata={op_name="jit(_update)/jit(main)/mul" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=211}
  %constant.476 = f64[] constant(-4.5946926660233629)
  %broadcast.869 = f64[100]{0} broadcast(f64[] %constant.476), dimensions={}
  %add.92 = f64[100]{0} add(f64[100]{0} %multiply.171, f64[100]{0} %broadcast.869), metadata={op_name="jit(_update)/jit(main)/sub" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=211}
  %param_0.9 = f64[] parameter(0)
  %broadcast.867 = f64[100]{0} broadcast(f64[] %param_0.9), dimensions={}, metadata={op_name="jit(_update)/jit(main)/sub" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=211}
  ROOT %subtract.7 = f64[100]{0} subtract(f64[100]{0} %add.92, f64[100]{0} %broadcast.867), metadata={op_name="jit(_update)/jit(main)/sub" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=211}
}

%region_0.1487 (Arg_0.1488: f64[], Arg_1.1489: f64[]) -> f64[] {
  %Arg_0.1488 = f64[] parameter(0)
  %Arg_1.1489 = f64[] parameter(1)
  ROOT %add.1490 = f64[] add(f64[] %Arg_0.1488, f64[] %Arg_1.1489), metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(0,)]" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=211}
}

%fused_computation.5 (param_0.12: f64[5]) -> f64[] {
  %param_0.12 = f64[5]{0} parameter(0)
  %log.0 = f64[5]{0} log(f64[5]{0} %param_0.12), metadata={op_name="jit(_update)/jit(main)/log" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=211}
  %constant.478 = f64[] constant(0)
  ROOT %reduce.16 = f64[] reduce(f64[5]{0} %log.0, f64[] %constant.478), dimensions={0}, to_apply=%region_0.1487, metadata={op_name="jit(_update)/jit(main)/reduce_sum[axes=(0,)]" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=211}
}

%fused_computation.7 (param_0.21: f64[100,100], param_1.33: f64[1,5]) -> f64[100,5,100] {
  %param_0.21 = f64[100,100]{1,0} parameter(0)
  %reshape.2027 = f64[10000]{0} reshape(f64[100,100]{1,0} %param_0.21)
  %broadcast.875 = f64[10000,5]{1,0} broadcast(f64[10000]{0} %reshape.2027), dimensions={0}, metadata={op_name="jit(_update)/jit(main)/vmap(transpose(jvp(mlp)))/linear_0/dot_general[dimension_numbers=(((), ()), ((), ())) precision=None preferred_element_type=None]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/basic.py" source_line=178}
  %param_1.33 = f64[1,5]{1,0} parameter(1)
  %reshape.2028 = f64[5]{0} reshape(f64[1,5]{1,0} %param_1.33), metadata={op_name="jit(_update)/jit(main)/squeeze[dimensions=(0,)]" source_file="/home/mathis/repos/backward_ica/src/online_smoothing.py" source_line=677}
  %broadcast.874 = f64[10000,5]{1,0} broadcast(f64[5]{0} %reshape.2028), dimensions={1}, metadata={op_name="jit(_update)/jit(main)/vmap(transpose(jvp(mlp)))/linear_0/dot_general[dimension_numbers=(((), ()), ((), ())) precision=None preferred_element_type=None]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/basic.py" source_line=178}
  %multiply.173 = f64[10000,5]{1,0} multiply(f64[10000,5]{1,0} %broadcast.875, f64[10000,5]{1,0} %broadcast.874), metadata={op_name="jit(_update)/jit(main)/vmap(transpose(jvp(mlp)))/linear_0/dot_general[dimension_numbers=(((), ()), ((), ())) precision=None preferred_element_type=None]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/basic.py" source_line=178}
  %reshape.2026 = f64[100,100,5]{2,1,0} reshape(f64[10000,5]{1,0} %multiply.173), metadata={op_name="jit(_update)/jit(main)/vmap(transpose(jvp(mlp)))/linear_0/dot_general[dimension_numbers=(((), ()), ((), ())) precision=None preferred_element_type=None]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/basic.py" source_line=178}
  ROOT %transpose.506 = f64[100,5,100]{1,2,0} transpose(f64[100,100,5]{2,1,0} %reshape.2026), dimensions={0,2,1}, metadata={op_name="jit(_update)/jit(main)/vmap(transpose(jvp(mlp)))/linear_0/transpose[permutation=(0, 2, 1)]" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/basic.py" source_line=178}
}

%fused_computation.8 (param_0.23: f64[100], param_1.37: f64[100,100]) -> f64[100,100] {
  %param_1.37 = f64[100,100]{1,0} parameter(1)
  %constant.479 = f64[] constant(1)
  %broadcast.878 = f64[100]{0} broadcast(f64[] %constant.479), dimensions={}, metadata={op_name="jit(_update)/jit(main)/vmap(jvp(mlp))/sub" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/nets/mlp.py" source_line=118}
  %param_0.23 = f64[100]{0} parameter(0)
  %subtract.8 = f64[100]{0} subtract(f64[100]{0} %broadcast.878, f64[100]{0} %param_0.23), metadata={op_name="jit(_update)/jit(main)/vmap(vmap(jvp(mlp)))/sub" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/nets/mlp.py" source_line=118}
  %broadcast.877 = f64[100,100]{1,0} broadcast(f64[100]{0} %subtract.8), dimensions={1}, metadata={op_name="jit(_update)/jit(main)/vmap(transpose(jvp(mlp)))/mul" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/nets/mlp.py" source_line=118}
  %multiply.175 = f64[100,100]{1,0} multiply(f64[100,100]{1,0} %param_1.37, f64[100,100]{1,0} %broadcast.877), metadata={op_name="jit(_update)/jit(main)/vmap(transpose(jvp(mlp)))/mul" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/nets/mlp.py" source_line=118}
  %broadcast.876 = f64[100,100]{1,0} broadcast(f64[100]{0} %param_0.23), dimensions={1}, metadata={op_name="jit(_update)/jit(main)/vmap(transpose(jvp(mlp)))/mul" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/nets/mlp.py" source_line=118}
  %multiply.174 = f64[100,100]{1,0} multiply(f64[100,100]{1,0} %multiply.175, f64[100,100]{1,0} %broadcast.876), metadata={op_name="jit(_update)/jit(main)/vmap(transpose(jvp(mlp)))/mul" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/nets/mlp.py" source_line=118}
  ROOT %add.93 = f64[100,100]{1,0} add(f64[100,100]{1,0} %multiply.175, f64[100,100]{1,0} %multiply.174), metadata={op_name="jit(_update)/jit(main)/vmap(transpose(jvp(mlp)))/add_any" source_file="/home/mathis/venvs/jax_gpu/lib/python3.10/site-packages/haiku/_src/nets/mlp.py" source_line=118}
}

%fused_computation.9 (param_0.26: f64[100,5], param_1.42: f64[5], param_2.24: f64[100,5]) -> f64[100,10] {
  %param_2.24 = f64[100,5]{1,0} parameter(2)
  %constant.480 = f64[] constant(0)
  %pad.22 = f64[100,10]{1,0} pad(f64[100,5]{1,0} %param_2.24, f64[] %constant.480), padding=0_0x0_5, metadata={op_name="jit(_update)/jit(main)/pad[padding_config=((0, 0, 0), (0, 5, 0))]" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=106}
  %param_0.26 = f64[100,5]{1,0} parameter(0)
  %param_1.42 = f64[5]{0} parameter(1)
  %broadcast.879 = f64[100,5]{1,0} broadcast(f64[5]{0} %param_1.42), dimensions={1}, metadata={op_name="jit(_update)/jit(main)/mul" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=107}
  %multiply.176 = f64[100,5]{1,0} multiply(f64[100,5]{1,0} %param_0.26, f64[100,5]{1,0} %broadcast.879), metadata={op_name="jit(_update)/jit(main)/mul" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=107}
  %pad.21 = f64[100,10]{1,0} pad(f64[100,5]{1,0} %multiply.176, f64[] %constant.480), padding=0_0x5_0, metadata={op_name="jit(_update)/jit(main)/pad[padding_config=((0, 0, 0), (5, 0, 0))]" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=106}
  ROOT %add.94 = f64[100,10]{1,0} add(f64[100,10]{1,0} %pad.22, f64[100,10]{1,0} %pad.21), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=106}
}

%fused_computation.10 (param_0.29: f64[500,5], param_1.47: f64[500,5], param_2.31: f64[500,5], param_3.27: f64[500,5]) -> f64[100,5,5] {
  %iota.344 = s32[5,5]{1,0} iota(), iota_dimension=0, metadata={op_name="jit(_update)/jit(main)/iota[dtype=int32 shape=(5, 5) dimension=0]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
  %iota.343 = s32[5,5]{1,0} iota(), iota_dimension=1, metadata={op_name="jit(_update)/jit(main)/iota[dtype=int32 shape=(5, 5) dimension=1]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
  %compare.56 = pred[5,5]{1,0} compare(s32[5,5]{1,0} %iota.344, s32[5,5]{1,0} %iota.343), direction=EQ, metadata={op_name="jit(_update)/jit(main)/eq" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
  %broadcast.884 = pred[100,5,5]{2,1,0} broadcast(pred[5,5]{1,0} %compare.56), dimensions={1,2}, metadata={op_name="jit(_update)/jit(main)/broadcast_in_dim[shape=(100, 5, 5) broadcast_dimensions=(1, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
  %param_3.27 = f64[500,5]{0,1} parameter(3)
  %copy.716 = f64[500,5]{1,0} copy(f64[500,5]{0,1} %param_3.27), metadata={op_name="jit(_update)/jit(main)/triangular_solve[left_side=False lower=True transpose_a=False conjugate_a=False unit_diagonal=False]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %constant.481 = f64[] constant(0.5)
  %broadcast.881 = f64[500,5]{1,0} broadcast(f64[] %constant.481), dimensions={}, metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %multiply.181 = f64[500,5]{1,0} multiply(f64[500,5]{1,0} %copy.716, f64[500,5]{1,0} %broadcast.881), metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %reshape.2032 = f64[5,100,5]{2,1,0} reshape(f64[500,5]{1,0} %multiply.181), metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.514 = f64[100,5,5]{2,0,1} transpose(f64[5,100,5]{2,1,0} %reshape.2032), dimensions={1,0,2}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 0, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.715 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{2,0,1} %transpose.514), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 0, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.513 = f64[100,5,5]{1,0,2} transpose(f64[5,100,5]{2,1,0} %reshape.2032), dimensions={1,2,0}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 2, 0)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.714 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{1,0,2} %transpose.513), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 2, 0)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %add.101 = f64[100,5,5]{2,1,0} add(f64[100,5,5]{2,1,0} %copy.715, f64[100,5,5]{2,1,0} %copy.714), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %param_2.31 = f64[500,5]{0,1} parameter(2)
  %copy.713 = f64[500,5]{1,0} copy(f64[500,5]{0,1} %param_2.31), metadata={op_name="jit(_update)/jit(main)/triangular_solve[left_side=False lower=True transpose_a=False conjugate_a=False unit_diagonal=False]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %multiply.180 = f64[500,5]{1,0} multiply(f64[500,5]{1,0} %copy.713, f64[500,5]{1,0} %broadcast.881), metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %reshape.2031 = f64[5,100,5]{2,1,0} reshape(f64[500,5]{1,0} %multiply.180), metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.512 = f64[100,5,5]{2,0,1} transpose(f64[5,100,5]{2,1,0} %reshape.2031), dimensions={1,0,2}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 0, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.712 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{2,0,1} %transpose.512), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 0, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.511 = f64[100,5,5]{1,0,2} transpose(f64[5,100,5]{2,1,0} %reshape.2031), dimensions={1,2,0}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 2, 0)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.711 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{1,0,2} %transpose.511), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 2, 0)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %add.100 = f64[100,5,5]{2,1,0} add(f64[100,5,5]{2,1,0} %copy.712, f64[100,5,5]{2,1,0} %copy.711), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %add.99 = f64[100,5,5]{2,1,0} add(f64[100,5,5]{2,1,0} %add.101, f64[100,5,5]{2,1,0} %add.100), metadata={op_name="jit(_update)/jit(main)/mul" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=149}
  %param_1.47 = f64[500,5]{0,1} parameter(1)
  %copy.710 = f64[500,5]{1,0} copy(f64[500,5]{0,1} %param_1.47), metadata={op_name="jit(_update)/jit(main)/triangular_solve[left_side=False lower=True transpose_a=False conjugate_a=False unit_diagonal=False]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %multiply.179 = f64[500,5]{1,0} multiply(f64[500,5]{1,0} %copy.710, f64[500,5]{1,0} %broadcast.881), metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %reshape.2030 = f64[5,100,5]{2,1,0} reshape(f64[500,5]{1,0} %multiply.179), metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.510 = f64[100,5,5]{2,0,1} transpose(f64[5,100,5]{2,1,0} %reshape.2030), dimensions={1,0,2}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 0, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.709 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{2,0,1} %transpose.510), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 0, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.509 = f64[100,5,5]{1,0,2} transpose(f64[5,100,5]{2,1,0} %reshape.2030), dimensions={1,2,0}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 2, 0)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.708 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{1,0,2} %transpose.509), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 2, 0)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %add.98 = f64[100,5,5]{2,1,0} add(f64[100,5,5]{2,1,0} %copy.709, f64[100,5,5]{2,1,0} %copy.708), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %add.97 = f64[100,5,5]{2,1,0} add(f64[100,5,5]{2,1,0} %add.99, f64[100,5,5]{2,1,0} %add.98), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=149}
  %param_0.29 = f64[500,5]{0,1} parameter(0)
  %copy.707 = f64[500,5]{1,0} copy(f64[500,5]{0,1} %param_0.29), metadata={op_name="jit(_update)/jit(main)/triangular_solve[left_side=False lower=True transpose_a=False conjugate_a=False unit_diagonal=False]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %multiply.178 = f64[500,5]{1,0} multiply(f64[500,5]{1,0} %copy.707, f64[500,5]{1,0} %broadcast.881), metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %reshape.2029 = f64[5,100,5]{2,1,0} reshape(f64[500,5]{1,0} %multiply.178), metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.508 = f64[100,5,5]{2,0,1} transpose(f64[5,100,5]{2,1,0} %reshape.2029), dimensions={1,0,2}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 0, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.706 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{2,0,1} %transpose.508), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 0, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.507 = f64[100,5,5]{1,0,2} transpose(f64[5,100,5]{2,1,0} %reshape.2029), dimensions={1,2,0}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 2, 0)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.705 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{1,0,2} %transpose.507), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 2, 0)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %add.96 = f64[100,5,5]{2,1,0} add(f64[100,5,5]{2,1,0} %copy.706, f64[100,5,5]{2,1,0} %copy.705), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %add.95 = f64[100,5,5]{2,1,0} add(f64[100,5,5]{2,1,0} %add.97, f64[100,5,5]{2,1,0} %add.96), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=149}
  %constant.482 = f64[] constant(-2)
  %broadcast.880 = f64[100,5,5]{2,1,0} broadcast(f64[] %constant.482), dimensions={}, metadata={op_name="jit(_update)/jit(main)/mul" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=149}
  %multiply.177 = f64[100,5,5]{2,1,0} multiply(f64[100,5,5]{2,1,0} %add.95, f64[100,5,5]{2,1,0} %broadcast.880), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=149}
  %negate.121 = f64[100,5,5]{2,1,0} negate(f64[100,5,5]{2,1,0} %multiply.177), metadata={op_name="jit(_update)/jit(main)/neg" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=107}
  %constant.483 = f64[] constant(0)
  %broadcast.882 = f64[100,5,5]{2,1,0} broadcast(f64[] %constant.483), dimensions={}, metadata={op_name="jit(_update)/jit(main)/broadcast_in_dim[shape=(100, 5, 5) broadcast_dimensions=(1, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=573}
  ROOT %select.65 = f64[100,5,5]{2,1,0} select(pred[100,5,5]{2,1,0} %broadcast.884, f64[100,5,5]{2,1,0} %negate.121, f64[100,5,5]{2,1,0} %broadcast.882), metadata={op_name="jit(_update)/jit(main)/select_n" source_file="/home/mathis/repos/backward_ica/src/variational/inference_nets.py" source_line=107}
}

%fused_computation.11 (param_0.31: f64[500,5], param_1.51: f64[500,5]) -> f64[100,5,5] {
  %iota.346 = s32[5,5]{1,0} iota(), iota_dimension=0, metadata={op_name="jit(_update)/jit(main)/iota[dtype=int32 shape=(5, 5) dimension=0]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
  %iota.345 = s32[5,5]{1,0} iota(), iota_dimension=1, metadata={op_name="jit(_update)/jit(main)/iota[dtype=int32 shape=(5, 5) dimension=1]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
  %compare.57 = pred[5,5]{1,0} compare(s32[5,5]{1,0} %iota.346, s32[5,5]{1,0} %iota.345), direction=EQ, metadata={op_name="jit(_update)/jit(main)/eq" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
  %broadcast.887 = pred[100,5,5]{2,1,0} broadcast(pred[5,5]{1,0} %compare.57), dimensions={1,2}, metadata={op_name="jit(_update)/jit(main)/broadcast_in_dim[shape=(100, 5, 5) broadcast_dimensions=(1, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
  %param_0.31 = f64[500,5]{1,0} parameter(0)
  %param_1.51 = f64[500,5]{1,0} parameter(1)
  %add.102 = f64[500,5]{1,0} add(f64[500,5]{1,0} %param_0.31, f64[500,5]{1,0} %param_1.51), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=563}
  %reshape.2033 = f64[100,5,5]{2,1,0} reshape(f64[500,5]{1,0} %add.102), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=563}
  %constant.484 = f64[] constant(0)
  %broadcast.886 = f64[100,5,5]{2,1,0} broadcast(f64[] %constant.484), dimensions={}, metadata={op_name="jit(_update)/jit(main)/broadcast_in_dim[shape=(100, 5, 5) broadcast_dimensions=(1, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=573}
  ROOT %select.66 = f64[100,5,5]{2,1,0} select(pred[100,5,5]{2,1,0} %broadcast.887, f64[100,5,5]{2,1,0} %reshape.2033, f64[100,5,5]{2,1,0} %broadcast.886), metadata={op_name="jit(_update)/jit(main)/select_n" source_file="/home/mathis/repos/backward_ica/src/stats/distributions.py" source_line=88}
}

%fused_computation.12 (param_0.33: f64[500,5], param_1.55: f64[500,5], param_2.46: f64[5], param_3.37: f64[100,5]) -> f64[100,5,5] {
  %iota.348 = s32[5,5]{1,0} iota(), iota_dimension=0, metadata={op_name="jit(_update)/jit(main)/iota[dtype=int32 shape=(5, 5) dimension=0]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
  %iota.347 = s32[5,5]{1,0} iota(), iota_dimension=1, metadata={op_name="jit(_update)/jit(main)/iota[dtype=int32 shape=(5, 5) dimension=1]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
  %compare.58 = pred[5,5]{1,0} compare(s32[5,5]{1,0} %iota.348, s32[5,5]{1,0} %iota.347), direction=EQ, metadata={op_name="jit(_update)/jit(main)/eq" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
  %broadcast.893 = pred[100,5,5]{2,1,0} broadcast(pred[5,5]{1,0} %compare.58), dimensions={1,2}, metadata={op_name="jit(_update)/jit(main)/broadcast_in_dim[shape=(100, 5, 5) broadcast_dimensions=(1, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
  %param_3.37 = f64[100,5]{1,0} parameter(3)
  %reshape.2035 = f64[500]{0} reshape(f64[100,5]{1,0} %param_3.37)
  %broadcast.892 = f64[500,5]{1,0} broadcast(f64[500]{0} %reshape.2035), dimensions={0}, metadata={op_name="jit(_update)/jit(main)/dot_general[dimension_numbers=(((), ()), ((), ())) precision=None preferred_element_type=None]" source_file="/home/mathis/repos/backward_ica/src/stats/kalman.py" source_line=15}
  %param_2.46 = f64[5]{0} parameter(2)
  %broadcast.891 = f64[500,5]{1,0} broadcast(f64[5]{0} %param_2.46), dimensions={1}, metadata={op_name="jit(_update)/jit(main)/dot_general[dimension_numbers=(((), ()), ((), ())) precision=None preferred_element_type=None]" source_file="/home/mathis/repos/backward_ica/src/stats/kalman.py" source_line=15}
  %multiply.182 = f64[500,5]{1,0} multiply(f64[500,5]{1,0} %broadcast.892, f64[500,5]{1,0} %broadcast.891), metadata={op_name="jit(_update)/jit(main)/dot_general[dimension_numbers=(((), ()), ((), ())) precision=None preferred_element_type=None]" source_file="/home/mathis/repos/backward_ica/src/stats/kalman.py" source_line=15}
  %param_1.55 = f64[500,5]{1,0} parameter(1)
  %add.104 = f64[500,5]{1,0} add(f64[500,5]{1,0} %multiply.182, f64[500,5]{1,0} %param_1.55), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/stats/kalman.py" source_line=16}
  %param_0.33 = f64[500,5]{1,0} parameter(0)
  %add.103 = f64[500,5]{1,0} add(f64[500,5]{1,0} %add.104, f64[500,5]{1,0} %param_0.33), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/stats/kalman.py" source_line=16}
  %reshape.2034 = f64[100,5,5]{2,1,0} reshape(f64[500,5]{1,0} %add.103), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/stats/kalman.py" source_line=16}
  %constant.485 = f64[] constant(0)
  %broadcast.889 = f64[100,5,5]{2,1,0} broadcast(f64[] %constant.485), dimensions={}, metadata={op_name="jit(_update)/jit(main)/broadcast_in_dim[shape=(100, 5, 5) broadcast_dimensions=(1, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=573}
  ROOT %select.67 = f64[100,5,5]{2,1,0} select(pred[100,5,5]{2,1,0} %broadcast.893, f64[100,5,5]{2,1,0} %reshape.2034, f64[100,5,5]{2,1,0} %broadcast.889), metadata={op_name="jit(_update)/jit(main)/select_n" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=77}
}

%fused_computation.13 (param_0.40: f64[500,5]) -> f64[500,5] {
  %param_0.40 = f64[500,5]{0,1} parameter(0)
  %copy.719 = f64[500,5]{1,0} copy(f64[500,5]{0,1} %param_0.40), metadata={op_name="jit(_update)/jit(main)/triangular_solve[left_side=False lower=True transpose_a=False conjugate_a=False unit_diagonal=False]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %constant.486 = f64[] constant(0.5)
  %broadcast.895 = f64[500,5]{1,0} broadcast(f64[] %constant.486), dimensions={}, metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %multiply.183 = f64[500,5]{1,0} multiply(f64[500,5]{1,0} %copy.719, f64[500,5]{1,0} %broadcast.895), metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %reshape.2039 = f64[5,100,5]{2,1,0} reshape(f64[500,5]{1,0} %multiply.183), metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.516 = f64[100,5,5]{2,0,1} transpose(f64[5,100,5]{2,1,0} %reshape.2039), dimensions={1,0,2}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 0, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.718 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{2,0,1} %transpose.516), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 0, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.515 = f64[100,5,5]{1,0,2} transpose(f64[5,100,5]{2,1,0} %reshape.2039), dimensions={1,2,0}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 2, 0)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.717 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{1,0,2} %transpose.515), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 2, 0)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %add.105 = f64[100,5,5]{2,1,0} add(f64[100,5,5]{2,1,0} %copy.718, f64[100,5,5]{2,1,0} %copy.717), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  ROOT %reshape.2037 = f64[500,5]{1,0} reshape(f64[100,5,5]{2,1,0} %add.105), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
}

%fused_computation.14 (param_0.49: f64[500,5]) -> f64[500,5] {
  %param_0.49 = f64[500,5]{0,1} parameter(0)
  %copy.723 = f64[500,5]{1,0} copy(f64[500,5]{0,1} %param_0.49), metadata={op_name="jit(_update)/jit(main)/triangular_solve[left_side=False lower=True transpose_a=False conjugate_a=False unit_diagonal=False]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %constant.487 = f64[] constant(0.5)
  %broadcast.897 = f64[500,5]{1,0} broadcast(f64[] %constant.487), dimensions={}, metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %multiply.184 = f64[500,5]{1,0} multiply(f64[500,5]{1,0} %copy.723, f64[500,5]{1,0} %broadcast.897), metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %reshape.2041 = f64[5,100,5]{2,1,0} reshape(f64[500,5]{1,0} %multiply.184), metadata={op_name="jit(_update)/jit(main)/div" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.519 = f64[100,5,5]{2,0,1} transpose(f64[5,100,5]{2,1,0} %reshape.2041), dimensions={1,0,2}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 0, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.722 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{2,0,1} %transpose.519), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 0, 2)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.518 = f64[100,5,5]{1,0,2} transpose(f64[5,100,5]{2,1,0} %reshape.2041), dimensions={1,2,0}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 2, 0)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.721 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{1,0,2} %transpose.518), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(1, 2, 0)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %add.106 = f64[100,5,5]{2,1,0} add(f64[100,5,5]{2,1,0} %copy.722, f64[100,5,5]{2,1,0} %copy.721), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.517 = f64[100,5,5]{1,2,0} transpose(f64[100,5,5]{2,1,0} %add.106), dimensions={0,2,1}, metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.720 = f64[100,5,5]{2,1,0} copy(f64[100,5,5]{1,2,0} %transpose.517), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  ROOT %reshape.2040 = f64[500,5]{1,0} reshape(f64[100,5,5]{2,1,0} %copy.720), metadata={op_name="jit(_update)/jit(main)/add_any" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
}

%fused_computation.15 (param_0.55: f64[5,500]) -> f64[500,5] {
  %param_0.55 = f64[5,500]{0,1} parameter(0)
  %copy.726 = f64[5,500]{1,0} copy(f64[5,500]{0,1} %param_0.55), metadata={op_name="jit(_update)/jit(main)/triangular_solve[left_side=True lower=True transpose_a=True conjugate_a=False unit_diagonal=False]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %reshape.2043 = f64[5,5,100]{2,1,0} reshape(f64[5,500]{1,0} %copy.726), metadata={op_name="jit(_update)/jit(main)/reshape[new_sizes=(5, 5, 100) dimensions=None]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %transpose.520 = f64[5,100,5]{1,2,0} transpose(f64[5,5,100]{2,1,0} %reshape.2043), dimensions={0,2,1}, metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(0, 2, 1)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %copy.725 = f64[5,100,5]{2,1,0} copy(f64[5,100,5]{1,2,0} %transpose.520), metadata={op_name="jit(_update)/jit(main)/transpose[permutation=(0, 2, 1)]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  %reshape.2042 = f64[500,5]{1,0} reshape(f64[5,100,5]{2,1,0} %copy.725), metadata={op_name="jit(_update)/jit(main)/reshape[new_sizes=(500, 5) dimensions=None]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
  ROOT %copy.724 = f64[500,5]{0,1} copy(f64[500,5]{1,0} %reshape.2042), metadata={op_name="jit(_update)/jit(main)/reshape[new_sizes=(500, 5) dimensions=None]" source_file="/home/mathis/repos/backward_ica/src/utils/misc.py" source_line=566}
}

%fused_computation.16 (param_0.61: f64[500,5]) -> f64[5,500] {
